/////////////////////////////////////////////////////////////////////////
///@system 量投系统基础库
///@company 上海量投网络科技有限公司
///@file Parameter.h
///20070820	hwp	创建该文件
/////////////////////////////////////////////////////////////////////////

#ifndef _PARAMETERMAP_H_
#define _PARAMETERMAP_H_

/////////////////////////////////////////////////////////////////////////
///CParameterMap用于参数名和参数值映射的抽象类，提供了按名称获取参数的方法
///@author	hwp
///@version	1.0,20070820
/////////////////////////////////////////////////////////////////////////
class CParameterMap 
{
public:
	///获取指定名称的参数值
	///@param	name	参数名称
	///@param	pStartId	指向起始的编号，如果为NULL，则表示从头开始，
	///			否则将从指定处+1开始，并且返回找到的编号+1。如果设为0，
	///			则表示从头开始，以后反复使用此函数，可以取出所有的同名配置
	///@return	此参数的值，如果有多项，则只返回第一项，如果没有，则返回""
	virtual char *getConfig(char *name, int *pStartId=NULL) = 0;
protected:
	///析构函数
	virtual ~CParameterMap(){};
};

#endif
